org/linux-efficient-tools.org
*** Arch Linux Efficient Tools

   Embrace open source and enjoy the world!
   
**** Software
    + firefox(plugins)
      + vimperator
      + firebug
      + autoproxy-ng
      + jsonview
      + greasemonkey
    + vim
    + emacs
    + oh-my-zsh
    + git
    + zathura
    + feh
    + screenfetch
    + ranger
**** Terminal Software
    + ranger
    + ncdu
    + htop
    + fzf
    + thefuck
    + cheat
    + ag
    + httpie
    + z
    + fpp
    + tmux
**** Terminal Command
    + fd - cd to selected directory
    + fda - including hidden directories
    + fdr - cd to selected parent directory
    + cf - fuzzy cd from anywhere
    + cdf - cd into the directory of the selected file
    + fe - open the selected file with the default editor(vim)
    + fo
        + Ctrl-O to open with 'open' Command
        + Ctrl-E or Enter key to open with the vimperator
    + vf - fuzzy open with vim from anywhere
    + fkill - kill process


