linux-efficient-tools.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-02-25 六 16:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" title="Standard" href="/style/worg.css" type="text/css" />
<link rel="alternate stylesheet" title="Zenburn" href="/style/worg-zenburn.css" type="text/css" />
<link rel="alternate stylesheet" title="Classic" href="/style/worg-classic.css" type="text/css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7e0031f">Arch Linux Efficient Tools</a>
<ul>
<li><a href="#org5b96de9">Software</a></li>
<li><a href="#orgc603265">Terminal Software</a></li>
<li><a href="#org16f2f89">Terminal Command</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org7e0031f" class="outline-2">
<h2 id="org7e0031f">Arch Linux Efficient Tools</h2>
<div class="outline-text-2" id="text-org7e0031f">
<p>
Embrace open source and enjoy the world!
</p>
</div>
<div id="outline-container-org5b96de9" class="outline-3">
<h3 id="org5b96de9">Software</h3>
<div class="outline-text-3" id="text-org5b96de9">
<ul class="org-ul">
<li>firefox(plugins)
<ul class="org-ul">
<li>vimperator</li>
<li>firebug</li>
<li>autoproxy-ng</li>
<li>jsonview</li>
<li>greasemonkey</li>
</ul></li>
<li>vim</li>
<li>emacs</li>
<li>oh-my-zsh</li>
<li>git</li>
<li>zathura</li>
<li>feh</li>
<li>screenfetch</li>
<li>ranger</li>
</ul>
</div>
</div>
<div id="outline-container-orgc603265" class="outline-3">
<h3 id="orgc603265">Terminal Software</h3>
<div class="outline-text-3" id="text-orgc603265">
<ul class="org-ul">
<li>ranger</li>
<li>ncdu</li>
<li>htop</li>
<li>fzf</li>
<li>thefuck</li>
<li>cheat</li>
<li>ag</li>
<li>httpie</li>
<li>z</li>
<li>fpp</li>
<li>tmux</li>
</ul>
</div>
</div>
<div id="outline-container-org16f2f89" class="outline-3">
<h3 id="org16f2f89">Terminal Command</h3>
<div class="outline-text-3" id="text-org16f2f89">
<ul class="org-ul">
<li>fd - cd to selected directory</li>
<li>fda - including hidden directories</li>
<li>fdr - cd to selected parent directory</li>
<li>cf - fuzzy cd from anywhere</li>
<li>cdf - cd into the directory of the selected file</li>
<li>fe - open the selected file with the default editor(vim)</li>
<li>fo
<ul class="org-ul">
<li>Ctrl-O to open with 'open' Command</li>
<li>Ctrl-E or Enter key to open with the vimperator</li>
</ul></li>
<li>vf - fuzzy open with vim from anywhere</li>
<li>fkill - kill process</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id='disqus_thread'></div>
                <script type='text/javascript'>
                    /* * * CONFIGURATION VARIABLES * * */
                    var disqus_shortname = 'callmesanye';

                    /* * * DON'T EDIT BELOW THIS LINE * * */
                    (function() {
                        var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
                        dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
                        (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
                    })();
                </script>
                <noscript>Please enable JavaScript to view the <a href='https://disqus.com/?ref_noscript' rel='nofollow'>comments powered by Disqus.</a></noscript>
                <p> Created by <a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 9.0.5) </p>
                <a href='#' class='back-to-top' id='fixed-back-to-top' style='display: inline;'></a>
</div>
</body>
</html>
